2d_compressible_openfoam/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            totalTemperature;
        T0              uniform 310;
        psi             thermo:psi;
        gamma           1.4;
        value           uniform 300;
    }
    topAndBottom
    {
        type            totalTemperature;
        T0              uniform 310;
        psi             thermo:psi;
        gamma           1.4;
        value           uniform 300;
    }
    outlet
    {
        type            zeroGradient;
    }
    airfoil
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
